# <!--    <?php-->
# <!--        // Подключаемся к серверу, на котором будем создавать базу данных. В данном случаи это локальный кеомпьютер на котором вы работаете. Его имя всегда localhost-->
# <!--        $HOST = "localhost";        // имя сервера-->
# <!--        $USER = "root";             // пользователь базы данных MySQL-->
# <!--        $PASS = "";                 // пароль для доступа к серверу MySQL-->
# <!--        $DB = "myphp";               // название создаваемой базы данных-->
#
#
# <!--        if(!mysqli_connect("$HOST", "$USER", "$PASS", "$DB")) exit(mysqli_error());-->
# <!--        else {echo "";}-->
#
# <!--        $r = mysqli_query("CREATE DATABASE $DB");-->
# <!--        if(!$r)exit(mysqli_error());-->
#
# <!--        if (!mysqli_select_db($DB)) exit(mysqli_error());-->
# <!--        else{echo "";}-->
#
# <!--        // устанавливаем кодировку-->
# <!--        mysqli_query('SET NAMES cp1251;');-->
# <!--        echo "База данных успешно создана.";-->
#
# <!--        ?>-->
